
# 120 vuotta olympia kilpailijoita (1896-2016)

päätimme tarkestella mitalisteja

In [2]:
import pandas as pd
import numpy as np

data = pd.read_csv("athlete_events.csv")

data.head()

data = data.dropna(subset = ['Medal'])
missing_count = data.isnull().sum()
print(missing_count)

ID           0
Name         0
Sex          0
Age        732
Height    8711
Weight    9327
Team         0
NOC          0
Games        0
Year         0
Season       0
City         0
Sport        0
Event        0
Medal        0
dtype: int64

In [3]:
missing_count = data.isnull().sum()

total_data = np.prod(data.shape)
total_missing = missing_count.sum()
per_of_missing_data = (total_missing / total_data) * 100
print(per_of_missing_data)

3.1453971126695657

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 39783 entries, 3 to 271103
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      39783 non-null  int64
 1   Name    39783 non-null  object
 2   Sex     39783 non-null  object
 3   Age     39051 non-null  float64
 4   Height  31072 non-null  float64
 5   Weight  30456 non-null  float64
 6   Team    39783 non-null  object
 7   NOC     39783 non-null  object
 8   Games   39783 non-null  object
 9   Year    39783 non-null  int64
 10  Season  39783 non-null  object
 11  City    39783 non-null  object
 12  Sport   39783 non-null  object
 13  Event   39783 non-null  object
 14  Medal   39783 non-null  object
dtypes: float64(3), int64(2), object(10)
memory usage: 4.9+ MB

In [5]:
data.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [9]:
data.index

Index([     3,     37,     38,     40,     41,     42,     44,     48,     50,
           60,
       ...
       271032, 271046, 271048, 271049, 271076, 271078, 271080, 271082, 271102,
       271103],
      dtype='int64', length=39783)

In [8]:
data.shape

(39783, 15)

In [7]:
data.values

array([[4, 'Edgar Lindenau Aabye', 'M', ..., 'Tug-Of-War',
        "Tug-Of-War Men's Tug-Of-War", 'Gold'],
       [15, 'Arvo Ossian Aaltonen', 'M', ..., 'Swimming',
        "Swimming Men's 200 metres Breaststroke", 'Bronze'],
       [15, 'Arvo Ossian Aaltonen', 'M', ..., 'Swimming',
        "Swimming Men's 400 metres Breaststroke", 'Bronze'],
       ...,
       [135554, 'Bogusaw Zych', 'M', ..., 'Fencing',
        "Fencing Men's Foil, Team", 'Bronze'],
       [135563, 'Olesya Nikolayevna Zykina', 'F', ..., 'Athletics',
        "Athletics Women's 4 x 400 metres Relay", 'Bronze'],
       [135563, 'Olesya Nikolayevna Zykina', 'F', ..., 'Athletics',
        "Athletics Women's 4 x 400 metres Relay", 'Silver']], dtype=object)

In [6]:
data[['Medal', 'Year']]

         Medal  Year
3         Gold  1900
37      Bronze  1920
38      Bronze  1920
40      Bronze  2014
41      Bronze  1948
...        ...   ...
271078  Silver  1956
271080  Bronze  1964
271082  Bronze  1980
271102  Bronze  2000
271103  Silver  2004

[39783 rows x 2 columns]

In [ ]:
data.loc[(data['Name'] == 'Paavo Ilmari Yrjl')]

In [ ]:
missing_count = data.isnull().sum()
print(missing_count)